// Повтори 10 раз!
// Напишите программу, которая выводит на экран слово "Привет" (без кавычек) 10 раз.
import java.util.Scanner;

class MyProgram{
    public static void main(String[] args){
        for ( int i = 0; i < 10; i++){
            System.out.println("Привет");
        }
    }
}

