/*SELECT 1
Введите запрос, который выведет только профессии из БД, приведённой в уроке, которые заканчиваются на букву "а". Эти профессии должны быть выведены по алфавиту.
Введите запрос в одну строку. Все слова в запросе разделяйте ровно одним пробелом. ASC дописывать не надо. Используйте одинарные кавычки. */

SELECT profession FROM professions WHERE profession LIKE '%а' ORDER BY profession

/* SELECT 2
 Найдите количество людей с именем Андрей в возрасте от 45 до 55 лет включительно. */



  

  
